In [1]:
import pandas as pd

In [2]:
sr1=pd.Series([0,1,2])
sr1

0    0
1    1
2    2
dtype: int64

In [3]:
sr2=pd.Series([3,4,5])
sr2

0    3
1    4
2    5
dtype: int64

In [5]:
pd.concat([sr1,sr2])

0    0
1    1
2    2
0    3
1    4
2    5
dtype: int64

In [6]:
sr2=pd.Series([3,4,5,6,7])
sr2

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [8]:
pd.concat([sr1,sr2])

0    0
1    1
2    2
0    3
1    4
2    5
3    6
4    7
dtype: int64

In [9]:
df1=pd.DataFrame({'ID':[1,2,3,4],
             'Names':['A','B','c','D'],
             'class':[5,6,7,8]})
df1

   ID Names  class
0   1     A      5
1   2     B      6
2   3     c      7
3   4     D      8

In [10]:
df2=pd.DataFrame({'ID':[5,6,7,8],
             'Names':['E','F','G','H'],
             'class':[9,10,11,12]})
df2

   ID Names  class
0   5     E      9
1   6     F     10
2   7     G     11
3   8     H     12

In [11]:
pd.concat([df1,df2])

   ID Names  class
0   1     A      5
1   2     B      6
2   3     c      7
3   4     D      8
0   5     E      9
1   6     F     10
2   7     G     11
3   8     H     12

In [12]:
pd.concat([df2,df1])

   ID Names  class
0   5     E      9
1   6     F     10
2   7     G     11
3   8     H     12
0   1     A      5
1   2     B      6
2   3     c      7
3   4     D      8

In [13]:
pd.concat([df1,df2],axis=1)

   ID Names  class  ID Names  class
0   1     A      5   5     E      9
1   2     B      6   6     F     10
2   3     c      7   7     G     11
3   4     D      8   8     H     12

In [14]:
pd.concat([df2,df1],axis=0)

   ID Names  class
0   5     E      9
1   6     F     10
2   7     G     11
3   8     H     12
0   1     A      5
1   2     B      6
2   3     c      7
3   4     D      8

In [15]:
pd.concat([df2,df1],axis=0,ignore_index=True)

   ID Names  class
0   5     E      9
1   6     F     10
2   7     G     11
3   8     H     12
4   1     A      5
5   2     B      6
6   3     c      7
7   4     D      8